{
  "title": "Whats for dinner test",
  "recipes": [
    {
      "title": "Greek Chicken Burgers",
      "pic": "https://images.media-allrecipes.com/userphotos/560x315/3752216.jpg",
      "ingredients": ["4 pita pockets","1/2 c. crumbled feta cheese","1 lb. ground chicken","1 large egg","loosely packed fresh mint leaves","6 oz. low-fat plain yogurt","4 c.romaine or iceberg lettuce", "3 plum tomatoes"],
      "directions": "1)Cut off 1/3 piece of each pita and grate on fine side of grater or pulse in food processor to make 1/2 cup bread crumbs. 2)In large bowl, mix crumbs, chicken, feta, egg, 1/4 cup mint, 1/4 teaspoon salt, and 1/8 teaspoon ground black pepper until just combined. Shape mixture into 8 small 3/4-inch-thick burgers. 3)Heat nonstick 12-inch skillet over medium heat. Add burgers and cook 10 to 12 minutes or until browned on both sides and cooked through. 4)Meanwhile, in small bowl, combine yogurt and remaining mint. 5)To serve, fill each pita with lettuce, tomatoes, 2 burgers, and yogurt sauce.  "
    },
    {
      "title": "The Perfect Hamburger",
      "pic": "http://worldstallestchef.com/wp-content/uploads/2010/05/burger.jpg",
      "ingredients": ["1 large egg, lightly beaten","2 tablespoons chili sauce", "1 teaspoon dried minced onion", "1 teaspoon prepared horseradish", "1 teaspoon Worcestershire sauce", "1/2 teaspoon salt", "Dash pepper", "1 pound lean ground beef (90% lean)", "4 hamburger buns, split", "Sliced tomato, Onion, Pickles and condiments, optional"],
      "directions": "1)In a large bowl, combine egg and seasonings. Crumble beef over mixture and mix well. Shape into four 3/4-in.-thick patties. 2) Grill, covered, on a greased grill rack over medium heat or broil 4 in. from the heat for 5-7 minutes on each side or until a thermometer reads 160° and juices run clear. Serve on buns, with toppings as desired. Yield: 4 servings."
    },
    {
      "title": "Turkey and Spicy Hummus Clubs",
      "pic": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/cm/15/11/54fe431d47545-turkey-spicy-hummus-clubs-recipe-ghk0812-xl.jpg",
      "ingredients": ["1 container hummus","1 tbsp. Asian chili sauce","1/4 c. light mayonnaise","1/4 tsp. smoked paprika", "8 slice reduced-sodium bacon" , "12 slice multigrain bread", "8 oz. reduced-sodium deli smoked turkey", "2 c. arugula", "2 medium tomatoes"],
      "directions": "1)In small bowl, stir together hummus and chili sauce. In another small bowl, stir together mayonnaise and smoked paprika.2)Place 4 slices bacon on paper-towel–lined microwave-safe plate. Cover with paper towel. Microwave on high 3 to 4 minutes or until crisp. Repeat with remaining 4 slices bacon and clean paper towels. Let cool completely; crumble. 3)Spread 1 tablespoon mayonnaise on one side of 4 slices bread. Spread 2 tablespoons hummus on one side of remaining slices of bread. 4) For each sandwich: Place one-fourth of turkey on 1 slice of bread with hummus. Place bread with mayonnaise on top. Layer 2 slices bacon, one-fourth of arugula, and one-fourth of tomatoes on top of mayo. Top with another slice of bread with hummus."
    },
    {
      "title": "Disaster",
      "pic": "http://images.mentalfloss.com/sites/default/files/styles/article_640x430/public/diet_coke_and_mentos.jpg",
      "ingredients": ["Large bottle of Diet Coke", "About half a pack of Mentos", "Geyser tube (optional but makes things much easier"],
      "directions": "Make sure you are doing this experiment in a place where you won't get in trouble for getting Diet Coke everywhere. Outside on some grass is perfect, please don't try this one in your family lounge!!      Stand the Diet Coke upright and unscrew the lid. Put some sort of funnel or tube on top of it so you can drop the Mentos in at the same time (about half the pack is a good amount). Doing this part can be tricky if you don't have a specially designed geyser tube, I recommend buying one from a local store such as Natures Discoveries (NZ) or online.      Time for the fun part, drop the Mentos into the Diet Coke and run like mad! If you've done it properly a huge geyser of Diet Coke should come flying out of the bottle, it's a very impressive sight. The record is about 9 metres (29 feet) high!"
    },
  {
      "title": "Vampite spagetti",
      "pic": "https://photos.bigoven.com/recipe/hero/vampire-spagetti.jpg",
      "ingredients": ["5 Roma Tomatoes" ,"6 gloves Garlic ; sliced/dices in garlic press","1/2 cup onions ; diced" , "1 cup Portabella Mushrooms ; diced (approx)", "2 tablespoons parsley ; diced" , "1/4 teaspoon Hungarian Paprika" , "1/2 cup Burgundy Red Wine" , "5 tablespoons Parmesan cheese grated" , "5 tablespoons Extra virgin olive oil"],
      "directions": "1)While water heats for spaghetti, assemble ingredients, and cut up veggies.2) Heat olive oil in frying pan over medium heat, and add onions and paprika when oil is hot. 3)Sauté till onions are translucent (watching temperature), and add tomatoes, parsley and garlic, bay leaf, and oregano. 4) Sauté till onions are translucent (watching temperature), and add tomatoes, parsley and garlic, bay leaf, and oregano. 5)Add mushrooms, and cook for about two minutes. 6) Add wine and simmer, 7)Let sauce simmer while spaghetti cooks. 8)When spaghetti is done, drain it and toss with a tablespoon of olive oil and half the grated cheese. 8)Stir rest of the cheese into the sauce. "
   }, 
	{
	
      "title": "Chinese fried rice",
      "pic" :"https://i2.wp.com/www.everydayeasyeats.com/wp-content/uploads/2016/06/Chinese-Fried-Rice-1.jpg?fit=680%2C453&ssl=1",
      "ingredients": ["3⁄4 cup finely chopped onion" , "1 egg, lightly beaten (or more eggs if you like)" , "3 drops soy sauce" , "3 drops sesame oil" , "8 ounces cooked lean boneless pork or 8 ounces chicken, chopped" , "1⁄2 cup finely chopped carrot (very small)" , "1⁄2 cup frozen peas, thawed", "4 cups cold cooked rice, grains separated (preferably medium grain", "4 green onions, chopped" , "2 cups bean sprouts", "2 tablespoons light soy sauce (add more if you like)"],
      "directions": "1)Heat 1 tbsp oil in wok; add chopped onions and stir-fry until onions turn a nice brown color, about 8-10 minutes; remove from wok.2)Mix egg with 3 drops of soy and 3 drops of sesame oil; set aside.3)Add 1/2 tbsp oil to wok, swirling to coat surfaces; add egg mixture; working quickly, swirl egg until egg sets against wok; when egg puffs, flip egg and cook other side briefly; remove from wok, and chop into small pieces. 4)Heat 1 tbsp oil in wok; add selected meat to wok, along with carrots, peas, and cooked onion; stir-fry for 2 minutes. 5)Add rice, green onions, and bean sprouts, tossing to mix well; stir-fry for 3 minutes. 6) Add 2 tbsp of light soy sauce and chopped egg to rice mixture and fold in; stir-fry for 1 minute more; serve."
	},
	{
     "title": "Avocado and Lime Bean Bowl",
      "pic": "https://www.google.com/search?q=Avocado+and+Lime+Bean+Bowl&source=lnms&tbm=isch&sa=X&ved=0ahUKEwip-6-WgNfaAhUEMd8KHTzXB1gQ_AUICygC&biw=904&bih=664#imgrc=2XC635ikUrKouM:",
      "ingredients": ["1/4 avocado" , "Pinch of cumin", "Pinch of coarse salt" , "1 tsp. sunflower seeds" , "1 tsp. lime juice", "2 bell pepper sides from Big-Batch Roasted Veggies", "1/2 c. Citrus and Mint Berries", "1/2 c. Breakfast Beans"],
      "directions": "1)Mash avocado with lime juice and a pinch each of cumin and coarse salt. 2)Spoon over bell pepper sides from the Big-Batch Roasted Veggies.3)Combine with Breakfast Beans, sunflower seeds, and a lime wedge. 4)Serve with Citrus and Mint Berries. "
	},
	{
      "title": "Easy Roasted Veggies and Tempeh Bowl Recipe",
      "pic": "https://www.simplyquinoa.com/wp-content/uploads/2017/04/balsamic-roasted-vegetable-quinoa-bowls-6.jpg",
      "ingredients": ["1 c. baby spinach", "1/2 c. shredded red cabbage", "1/2 c. quinoa", "1 c. assorted roasted veggies", "1 piece roasted tempeh ", "2 tbsp. Chopped cilantro" , "1/4 tsp. toasted sesame oil" , "Sliced radishes", "lime wedge"],
      "directions": "1)Fill a bowl with baby spinach, shredded red cabbage, cooked quinoa, and assorted roasted veggies (we used ½ cup each tomatoes and broccoli). 2)Top with roasted tempeh and chopped cilantro; drizzle with toasted sesame oil. 3) Heat in microwave. 4) Garnish with sliced radishes and a lime wedge."
	},
	{
      "title": "Roasted Mushroom Parmesan Sandwich",
      "pic": "https://hips.hearstapps.com/ghk.h-cdn.co/assets/18/03/2048x1024/landscape-1516382799-roasted-mushroom-parm-sandwich-ghk-0218.jpg?resize=1200:*",
      "ingredients": ["1/4 c. panko", "1/2 tsp. dried oregano" , "4 large portobello mushroom caps" , "4 hero rolls", "4 oz. fresh mozzarella" , "1/4 c. Grated Parmesan" , "1/2 c. jarred marinara sauce" , "parsley"],
      "directions": "1)Preheat the broiler. Line the baking sheet with the nonstick foil. 2)In a small bowl, combine 1/4 cup panko with 1 tablespoon olive oil and 1/2 teaspoon dried oregano. 3)Place 4 large portobello mushroom caps on the prepared baking sheet and brush with 1 tablespoon olive oil and season with kosher salt and pepper. Place in the oven and broil until mushrooms are just tender and beginning to release juices, 6 to 8 minutes. 4) While the mushrooms are broiling, split and toast 4 hero rolls, slice 4 ounces fresh mozzarella, and grate 1/4 cup Parmesan. Divide the cooked mushrooms among the bottom halves of the toasted rolls, then top each with 2 tablespoons jarred marinara sauce, 1/4 of the sliced fresh mozzarella and 1 tablespoon grated Parmesan. 5) Broil until the cheese melts, 1 to 2 minutes. Top with the panko mixture, and broil until golden brown, 30 seconds. Sprinkle with chopped parsley before serving, if desired."
	},
	{

      "title": "Prosciutto-Melon Panini",
      "pic": "http://ghk.h-cdn.co/assets/cm/15/11/54fe1b9f787c4-pita-panini-with-arugula-salad-recipe-lg.jpg",
      "ingredients": ["1 ciabatta roll" , "2 tbsp. Canteloupe Jam" , "4 thin slices mozzarella" , "4 slices prosciutto", "arugula"],
      "directions": "1) On split ciabatta roll, spread Cantaloupe Jam; layer bottom with mozzarella, prosciutto and handful of arugula. 2)Bake in oven at 425 degrees F until cheese melts. "

	},
	{
     "title": "New World Succotash",
      "pic": "https://imagesvc.timeincapp.com/v3/mm/image?url=http%3A%2F%2Fcdn-image.myrecipes.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2Fimage%2Frecipes%2Fsl%2F08%2F08%2Fpea-succotash-sl-1823313-x.jpg%3Fitok%3DFe4cn9eA&w=700&q=85",
      "ingredients": ["2 slice thick-cut bacon","4 medium carrots","3 c. fresh corn kernels","1 bag edamame","1 lemon","1/4 c. snipped fresh chives" , "tsp. cayenne (ground red pepper)" , "salt"],
      "directions": "1)In 12-inch skillet, cook bacon on medium 8 minutes or until browned and crisp, turning occasionally. While bacon cooks, peel and cut carrots into quarters lengthwise, then cut crosswise at an angle into 1 1/2-inch pieces. Drain bacon on paper towels. Remove and discard all but 1 tablespoon fat from skillet. 2)To skillet, add carrots and 1/4 cup water. Cover and cook 6 minutes. Add corn and edamame and cook, uncovered, 8 to 10 minutes or until vegetables are tender, stirring occasionally. 3)Meanwhile, from lemon, grate 1 teaspoon peel and squeeze 1 tablespoon juice into large bowl. Add vegetable mixture, chives, cayenne, and 1/2 teaspoon salt; toss to combine. 4)To serve, crumble bacon and sprinkle over succotash.   "

	},
	{
    "title": "Veggie Focaccia",
      "pic": "https://thumbs.dreamstime.com/b/healthy-veggie-panini-vegetable-focaccia-white-39519363.jpg",
      "ingredients": ["1 tbsp. red wine vinegar","1 tbsp. extra-virgin olive oil","1 small shallot","1/2 tsp. chopped fresh thyme leaves","salt","pepper","1 jar artichoke hearts","1 jar red peppers","3 oz. baby spinach leaves" , "4 piece focaccia bread", "1/4 c. prepared basil pesto"],
      "directions": "1)In small bowl, whisk together vinegar, oil, shallot, thyme, 1/8 teaspoon salt, and 1/8 teaspoon freshly ground black pepper. Place artichokes in a medium bowl, peppers in another bowl, and spinach in a third bowl. Divide dressing among all 3 bowls. Toss all food in bowls until well coated. 2)With serrated knife, split each focaccia square horizontally in half. In another small bowl, stir together pesto and mayonnaise. Spread on all cut sides of focaccia. 3)On each bottom half of focaccia, layer one-fourth each of spinach, peppers, mozzarella, and artichokes. Replace top halves of focaccia.  "


	}


  ]
}