{
  "title": "Whats for dinner test",
  "recipes": [
    {
      "title": "Chicken Parmigiana",
      "pic": "https://www.gourmandize.com/media/10037_crop.jpg/tsp/chicken-parmigiana.jpg",
      "ingredients": [],
      "directions": ""
    },
    {
      "title": "The Perfect Hamburger",
      "pic": "http://worldstallestchef.com/wp-content/uploads/2010/05/burger.jpg",
      "ingredients": ["1 large egg, lightly beaten","2 tablespoons chili sauce", "1 teaspoon dried minced onion", "1 teaspoon prepared horseradish", "1 teaspoon Worcestershire sauce", "1/2 teaspoon salt", "Dash pepper", "1 pound lean ground beef (90% lean)", "4 hamburger buns, split", "Sliced tomato, Onion, Pickles and condiments, optional"],
      "directions": "1)In a large bowl, combine egg and seasonings. Crumble beef over mixture and mix well. Shape into four 3/4-in.-thick patties. 2) Grill, covered, on a greased grill rack over medium heat or broil 4 in. from the heat for 5-7 minutes on each side or until a thermometer reads 160° and juices run clear. Serve on buns, with toppings as desired. Yield: 4 servings."
    },
    {
      "title": "Prime Rib",
      "pic": "http://www.windsorstar.com/news/cms/binary/6074586.jpg?size=640x420",
      "ingredients": [],
      "directions": ""
    },
    {
      "title": "Disaster",
      "pic": "http://images.mentalfloss.com/sites/default/files/styles/article_640x430/public/diet_coke_and_mentos.jpg",
      "ingredients": ["Large bottle of Diet Coke", "About half a pack of Mentos", "Geyser tube (optional but makes things much easier"],
      "directions": "Make sure you are doing this experiment in a place where you won't get in trouble for getting Diet Coke everywhere. Outside on some grass is perfect, please don't try this one in your family lounge!!      Stand the Diet Coke upright and unscrew the lid. Put some sort of funnel or tube on top of it so you can drop the Mentos in at the same time (about half the pack is a good amount). Doing this part can be tricky if you don't have a specially designed geyser tube, I recommend buying one from a local store such as Natures Discoveries (NZ) or online.      Time for the fun part, drop the Mentos into the Diet Coke and run like mad! If you've done it properly a huge geyser of Diet Coke should come flying out of the bottle, it's a very impressive sight. The record is about 9 metres (29 feet) high!"
    }
  ]
}